// map.c
#include <ansi.h>

inherit ITEM;

void create()
{
	set_name( HIC "『江陵旅游图』" NOR, ({ "luyou tu", "tu" }) );
	set_weight(10);
	if( clonep() )
		set_default_object(__FILE__);
	else {
		set("unit", "张");
		set("long", @TEXT
                 『江陵旅游图』

                            <三不管>
                                 ＼
                                  黄土路
                                    │
                ∧   ∧            北门
               ∧∧∧∧∧           │
               武当山∧∧    墓碑铺-┼-打铁铺      ■荆州
                                    │
                             棺材铺-西-小巷—小巷—东-元妙观
            ∧                      │             │
          神∧∧               书铺-┼-<知府衙门>—街-茶馆
          龙∧∧                    街             │
          架∧∧             开元观-┼-<万家大院> 东门        
          ∧∧∧∧ — 古隆中       南门            │
              │        │          │             │        ∧
              │       山道—山道—山道—-山道——山道—山冈∧∧
              │                    │
              │           太晖观—小屋
             山道                   │  ∧
              │             古庙—山冈 ∧∧
              │                    │
          ≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈
            白帝城—瞿塘峡—巫峡—西陵峡    ≈≈
          ≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈长
                   ∧        │             ≈≈
             长坂坡∧∧——当阳桥——城陵矶 ≈江
                             │             ≈≈
                           大驿道    ■汉口 ≈≈
                             │             ≈≈
                      钱  庄-汉-四季美      ≈≈
                             │             ≈≈
                      老通城-┼-码头 ■汉阳 ≈≈ 码头
                             正             ≈≈  │
                      菊花会-┼-古琴台      ≈≈ 赤壁  ■武昌
                             │             ≈≈  │
                      药材店-街-晴川客栈    ≈≈ 黄鹤楼—东湖≈≈
                             │             ≈≈         ≈≈≈≈
                      杂货店-┼-归元寺      ≈≈ 
                             │             ≈≈ 
                           黄土路           ≈≈
                             │
               农田-黄土路-黄土路
                │            ＼
山洞-西山小路-麻溪铺-菜地    <岳阳>

   ■知府衙门

           书房 — 走廊 — 灵堂 — 甬道 — 牢房
            │      │      │     ︽︽︽︽
   大堂 — 花圃 — 东厢房  废园┼┼小楼  ︽高
            │             ┼┼┼┼      ︽墙
           客厅 — 膳房      ┼┼︽︽︽︽︽

   ■万家大院

           北楼 — 书房    ︽︽︽︽︽
            │               ┼┼┼︽围
   大门 — 大厅 — 东楼 — 花园  ┼︽
            │             ┼┼  ┼︽
           南楼 — 柴房  ┼破祠堂┼︽墙
                         ︽︽︽︽︽︽

TEXT);
		set("value", 50);
		set("material", "paper");
	}
	setup();
}
