//  Room:  /d/luoyang/youshe1.c
#include <ansi.h>
inherit  ROOM;

void  create  ()
{
	set("short",  "右舍");
	set("long",  @LONG
走进小舍，见桌椅几榻，无一而非竹制，墙上悬着一幅墨竹，笔势
纵横，墨迹淋漓，颇有森森之意。桌上放着一具瑶琴 (qin)，一管洞箫
(xiao)。
LONG);
	set("exits",  ([  /*  sizeof()  ==  2  */
		"southwest"  :  __DIR__"lvzhuxiaoyuan",
	]));
	set("item_desc",  ([
		"qin" : 
"这就是著名的古琴：“焦尾桐琴”。据说是稽康在看到一个
农夫焚烧桐木时，抢出来后调制成的名器。你若有兴，不妨
抚(fu)琴一曲如何？\n",
		"xiao" : 
"这是一只"HIG"绿玉长箫"NOR"，尤为难得的是，近口处一点"HIR"殷红如血"NOR"，
衬托着这支箫管格外精神。\n",
	]));
	set("no_clean_up", 0);
	set("coor/x", -379);
	set("coor/y", 40);
	set("coor/z", 0);
	setup();
}

void init()
{
        add_action("do_fu", "fu");
}

int do_fu(string arg)
{
	object me = this_player();

	if (!arg || arg != "qin")
		return notify_fail("你只能抚琴(qin)，别的抚不得。\n");
	switch( random(4) )
	{
		case 0:
			message_vision("$N坐了下来，手指轻捻，一首节奏婉转的汉时古曲《"HIY"有所思"NOR"》如流水般响起。\n\n", me);
			break;
		case 1:
			message_vision("$N盘膝坐下，弹了一首《"HIC"碧霄吟"NOR"》，洋洋然颇有青天一碧、万里无云的空阔气象。\n\n", me);
			break;
		case 2:
			message_vision("$N走到几前，端正坐下，《"HIG"清心普善咒"NOR"》琴韵轻轻响起。曲调却是柔和之至，宛如一人轻轻叹息，又似是朝露暗润花瓣，晓风低拂柳梢。旁人听不多时，眼皮便越来越沉重，虽竭力凝神，却终是难以抗拒睡魔，不久眼皮合拢，再也睁不开来，身子软倒在地，便即睡着了。睡梦之中，仍隐隐约约听到柔和的琴声，似有一只温柔的手在抚摸自己头发，像是回到了童年，在妈妈的怀抱之中，受她亲热怜惜一般。过了良久良久，琴声方才止歇。\n\n", me);
			break;
		case 3:
			message_vision("$N走到几前，手指轻拨几下琴弦，就弹奏起来。这一曲时而慷慨激昂，时而温柔雅致，间或有热血如沸的激奋。奏了良久，琴韵渐缓，似乎乐音在不住远去，倒像奏琴之人走出了数十丈之遥，又走到数里之外，细微几不可再闻。琴音似止未止之际，却有一二下极低极细的箫声在琴音旁响了起来。回旋婉转，箫声渐响，恰似吹箫人一面吹，一面慢慢走近，箫声清丽，忽高忽低，忽轻忽响，低到极处之际，几个盘旋之后，又再低沉下去，虽极低极细，每个音节仍清晰可闻。渐渐低音中偶有珠玉跳跃，清脆短促，此伏彼起，繁音渐增，先如鸣泉飞溅，继而如群卉争艳，花团锦簇，更夹着间关鸟语，彼鸣我和，渐渐的百鸟离去，春残花落，但闻雨声萧萧，一片凄凉肃杀之象，细雨绵绵，若有若无，终于万籁俱寂。这正是《"HIM"笑傲江湖之曲"NOR"》。\n\n", me);
			break;
	}
	return 1;
}