感悟泥潭                                 赵浪-vingp(Thu Sep 17)
----------------------------------------------------------------------
    暑假至今，赵浪此人身陷泥潭，不经意间，也已长大成人。
    其历经江湖四年风雨。现如今，虽非盖世武功，但也并非泛泛之辈。想当年，
幼小体弱，连只兔子也得让其三分，溜之大吉。往事不堪回首。现如今也能一剑
毙之取其肉以飨天下英雄好汉。
    忆当年，赵浪此人呱呱堕地于世间。年幼无知,不善言语。semote除会用hi与
bye之外，就是些不伦不类的胡语乱语，其口齿之呆滞，使人啼笑皆非。令人心慰
的是，他倒痴于练武，心诚可见，实属不易。十五岁经验达三千多。十六岁达一万
多，然而武功技能却不敢恭维。因而，十六岁后，他就不敢再留恋经验而苦练技能
4，到了十八岁，也算略有小成。
    此人成长过程，先前口齿不灵。不料，后来，他却顽皮成性，不通世务。练武
之余，游山玩水，行迹江湖，沾花惹草。此天性，对其实在无可奈何。此人性格也
令人琢磨不透，时而对人heihei一下，时而又对人love个不停。时而沉默不语，时
而又用semote拂乱一阵。实在很想扁他一顿。
    如今，他也已长大成人，正值青春年少之际。实想觅一红尘知己，雨夜风晨，
花前月下。无奈其所识之女侠，要么为未成年少女，要么就已为人妻。实为一大
憾事。或许一日，萍水相逢。嘻！嘻！
    曾经见过太多的离别，并且也为赵浪疲惫不堪。不知怎么也有些老之感。实
想，催促赵浪金盆洗手、退隐江湖，无奈于心有所不忍。久之，越陷越深。世耶？
梦耶？
    泥潭春光无限好，mud秋雨几多愁!
    路漫漫其修远，吾将上下而求索！.

