// Room: /d/nanshaolin/putiyuan.c
// Last Modified by winder on May. 29 2001

inherit ROOM;
string look_mirror();
string look_zuo();
string look_jie();

void create()
{
	set("short", "ÆĞÌáÔº");
	set("long", @LONG
Ò»×ùÆ«Æ§Òõ°µµÄ·ğµî£¬µîÉÏ²¢ÅÅÅÅÁĞ×ÅÈı×ğ·ğÏñ£¬·ğÏñÇ°×°×ÅÒ»×ù
ÆÁ·ç£¬ÆÁ·çÉÏÏâÇ¶×ÅÒ»¿é¼«´óµÄÍ­¾µ(mirror)¡£²ÁµÄ¾§¹â¾»ÁÁ¡£·ğÏñÏÂ
ÊÇÒ»¸öÉñ×ù (zuo)£¬°Ú×ÅÁ½Õµ·¢³ö¶¹»Æ¹âÔÎµÄÓÍµÆ¡£»è»ÆµÄµÆ¹âÏÂ£¬ÒÀ
Ï¡¼ûµ½¾µÉÏïÔÓĞ¼¸¾ä·ğÙÊ (jie)¡£ÆÁ·çÇ°ÓĞ¼¸¸öÆÑÍÅ£¬¼¸¸öÇàÄêÉ®ÈËÕı
ÔÚ±ÕÄ¿´ò×ø£¬¶«ÃæÊÇÒ»Æ¬»±Ê÷ÁÖ¡£
LONG );
	set("exits", ([
		"east" : __DIR__"huaishu1",	
       	]));
	set("item_desc",([
		"mirror" : (: look_mirror :),
		"zuo"    : (: look_zuo :),
		"jie"    : (: look_jie :), 
	]));
	set("objects",([
		CLASS_D("nanshaolin") + "/dayang" : 1,
		__DIR__"npc/xiao-ku" : 1, 
	]));
	set("coor/x", 1780);
	set("coor/y", -6220);
	set("coor/z", 10);
	setup();
}

string look_mirror()
{
	return "Ò»¸ö¾Ş´óµÄÇàÍ­¾µ£¬ÏâÔÚÆÁ·çÉÏ£¬¿ÉÇå³şµÄ¿´µ½µîÉÏÖÚÈËµÄ±³Ó°¡£\n";
}

string look_jie()
{
	return
	"    ¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù\n"
	"    ¡ù¡ù¡ù¡ù¡¡¡¡¡¡¡¡¡¡¡¡    ¡¡¡¡¡¡¡¡¡ù¡ù¡ù¡ù\n"
	"    ¡ù¡ù¡ù¡ù¡¡  Ò»ÇĞÓĞÎª·¨£¬¡¡      ¡ù¡ù¡ù¡ù\n"
	"    ¡ù¡ù¡ù¡ù¡¡¡¡¡¡¡¡¡¡¡¡¡   ¡¡¡¡¡¡¡¡¡ù¡ù¡ù¡ù\n"
	"    ¡ù¡ù¡ù¡ù¡¡  ÈçÃÎ»ÃÅİÓ°£¬¡¡      ¡ù¡ù¡ù¡ù\n"
	"    ¡ù¡ù¡ù¡ù¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¢=¡¡¡¡¡¡¡ù¡ù¡ù¡ù\n"
	"    ¡ù¡ù¡ù¡ù¡   ÈçÂ¶ÒàÈçµç£¬      ¡¡¡ù¡ù¡ù¡ù\n"
	"    ¡ù¡ù¡ù¡ù¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡ù¡ù¡ù¡ù\n"
	"    ¡ù¡ù¡ù¡ù¡¡  µ±×öÈçÊÇ¹Û¡£      ¡¡¡ù¡ù¡ù¡ù\n"
	"    ¡ù¡ù¡ù¡ù¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡ù¡ù¡ù¡ù\n"
	"    ¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù\n";
}
      
string look_zuo()
{ 
	return "ÕâÊÇÒ»¸ö»ÆÑïÄ¾ÖÆµÄ´óÉñ×ùÉÏÃæÖ§³Å×ÅÈı×ù·ğÏñ¡£\n";
}
