// fandog.c
# include <ansi.h>
inherit NPC;
void create()
{
	set_name("凡狗", ({ "fandog"}));
        set("title", HIM"网友联谊会会长"NOR);
	set("gender", "男性");
	set("long", "
这是一只纯种博美名犬，身上的毛没有几根，但却如黄金般
璀璨，梳理得一丝不苟，油光水滑，两只眼睛水灵灵的，温
情脉脉地看着你......人耶？狗耶？如果是狗应是一条好狗，
是人更应是一条好汉！\n");
	set("nickname", HIY"没毛犬"NOR);
	set("age", 29);
	set("class", "eunach");
	set("attitude", "friendly");
        set("no_get", "1");
	set("inquiry", ([
                 "here": "嘿嘿，泥巴知道吧？会让你难以自拔，一陷没顶。\n",
                 "name": "【 天  帝 】千年虫「思念是一种很好吃的骨头」凡狗(Fandog)\n",
               "rumors": "最近有一批人质需要护送，江湖上已经有无数豪杰为之送命了。你还是不要轻易尝试的好。\n",
                 "洗澡": "好啊好啊，你要和我一起洗吗？我要为你搓搓背，我要为你洗白白。\n",
                 "撒尿": "问我这事干嘛。羞人答答的说。不过我那样的时候姿势还挺优雅。\n",
                 "xuxu": "您也懂俺酷狗帮的黑话？这不现在没人，您蹲那墙角一尥蹶子就成。\n",
               "洗白白": "我已经够白的了。我看您脖子上那油渍怪恶心的，回去用洁厕灵抹抹吧。\n",
                  "mud": "你呀，可真是个小呆瓜。你不是在玩泥巴吗？还问这个干嘛？\n",
                 "泥巴": "小时候我就爱玩，现在还在玩。玩泥巴那么久，我连毛都掉光啦，所以人家叫我“没毛犬”。\n",
               "黄国凡": "你小子给我当心，既然我的底细已经被你知道了，你也命不久矣。\n",
             "laughing": "你说他呀，大帅哥的说。你手头有漂亮美眉么，给他来一个。\n",
               "笑笑生": "《金瓶梅》是他写的。你想看？找我借吧。\n",
                 "风儿": "想不想抱抱他的ｂａｂｙ？嘿嘿，还得看ｊａｖａ的。\n",
                 "仙子": "想不想抱抱他的ｂａｂｙ？嘿嘿，还得看ｗｉｎｄｅｒ的。\n",
                 "java": "一种计算机编程语言。一个印度洋上的小岛。一位天后。天帝ｗｉｎｄｅｒ的老婆。一个未来的泥虫的妈妈。\n",
               "winder": "这小子在长安乐坊开了个赌局，去骗点儿他的钱吧。\n",
                 "凡狗": "没看见吗？你面前如此高大威猛的大狗狗。啊，你难道不爱他？\n",
               "fandog": "狗儿的日子简简单单，没什么好问的。\n",
               "gladys": "她的外事活动由我安排。想找她吃饭吗？先跟我预约。\n",
                 "降雪": "没见过下雪么？那就在泥巴里呆着吧。总有一天你能等到的。\n",
		 "lily": "你说的是噜噜秋的妻子么？呀，那可是个大美人哪！噜噜秋很疼她的。\n",
                 "ppmm": "这里太多啦。象老标啦，唐方啦，沈浪啦，全都是。\n",
                 "美眉": "盼望着，盼望着，东风来了，春天的脚步近了。你聪明的，能告诉我，我的美眉在哪里么？\n",
            "tomtittot": "你说饭饭呀，她是我妹妹。我们小时候一起抢猪蹄吃，长大了一起写诗。\n",
                 "饭饭": "问她干嘛，人家都已经有男朋友了。不怕到北京被暴打一顿吗？\n",
                  "lcf": "疾风之铃音？这家伙成天领了一帮美眉玩星际争霸，我看他越来越象虫族的人了。\n",
                "uncle": "静林？你连你叔都忘了，小时候他还给你把过尿呢。\n这不，峨嵋的掌门周大姑娘刚生了个娃儿，就把你叔给请去带小\n孩了。那小子艳福不浅哪，啧啧，那里可全是尼姑哪。\n",
                 "wyxl": "小小猪猪？这家伙有点儿花痴，最近换了个名儿叫“花神”。\n",
                "xxqqf": "老标？跟我一样流氓。小心别惹他，此人的体重可以把你坐死。\n",
                 "老标": "听说这小子最近娶了个如花似玉的老婆，脾气变得好多了。\n",
                  "shh": "他在昆仑山上盖了幢别墅，昨儿个还请我去他那儿吃水煮活鱼来着。\n",
                 "沈浪": "此人已经不再习练七伤拳了，开始钻研计算机，最近经常在厦大上课。\n",
                 "爱好": "也没有什么特别的爱好，偶喜欢多肉的骨头和——奔～跑～\n",
                  "fhx": "傅红雪呀，这小子喜欢骑摩托带美眉兜风，不过最近好象摩托车被偷了，只好玩泥巴啦。也好，泥巴比美眉好玩多了。您说是吧？\n",
                 "asia": "你说小洲啊？这小子整天挖泥巴，昨儿个拿了一沓电话帐单哭着找我来了，说是他爸准备ＰＫ他了。\n",
               "傅红雪": "这家伙可不是美眉，虽然名字很香艳。你想泡他？人家一招你就没屁了。\n",
                 "叶开": "你问的这个人哪，名声太响啦。不过这小子跟我交情不错，你有什么要他帮忙的么？比如介绍你认识认识丽春院的老鸨婆什么的？\n",
               "苏明泉": "好小子，你从哪里听到这个名字的？估计你活不过晌午了。\n",
               "叶亚洲": "哦，你问他？他已经是江湖一代名侠了，传说中的武当剑客小白龙，桃花仙子阿紫，美艳神秘的上官小仙和慕容小雪，其实全是他。\n",
                  "top": "寒星？他喜欢和老婆一起在山上种茶，在屋旁浇花。他的外号叫乌龙茶，老婆若冰外号是铁观音，大儿子本雪在大理当差种茶花，小女儿月兔正招亲呢。\n",
                 "bsrx": "碧水柔星？那可是武当派大师兄，名头可响亮了。她有好多女儿，蓝蝴蝶，红蝴蝶，花蝴蝶，成天飞来飞去的让人眼花呢。\n",
                "donal": "小唐？这小子挺能整的，跟一键无雪两个大老爷们生了三个大胖小子。\n",
                "glass": "要是哪天树叶儿落了，荷花谢了，帘卷西风了，人比黄花瘦了，那你就能看到她了。\n",
              "mamagic": "小魔女？华山的小姑娘。有她老公黑月追风罩着，我看你还是别惹她了。\n",
                  "dra": "不如归去？这会儿你上街沽一壶酒，买点儿酱鸭卤肉，\n等你回来，他呀，一准在你家窝着了。这小子练功稀稀拉拉的，\n可要是有赌局酒席，他就屁颠屁颠地来啦。咳，也是，打打杀杀\n那么累干嘛，不如归去，回家陪老婆去。\n",     
                 "zell": "风？吹过，就没影儿了。不过你还是能见到他，有时他来这里看看老婆。\n",
                   "pk": "好小子，我看你脸上一股黑气，可能大难临头了。劝你还是少做恶人的好。\n",
                 "流氓": "谁？你说谁哪？哥们儿，你今儿个可找对主儿了。咱们这就开练？是单挑还是群殴，随便。\n",
                "wendy": "随缘？小伙子人挺好，就是不好好练功，成天老想着泡妞，你可别跟他学。\n",
                  "lzw": "你说的那是李大嘴。咳，她呀，从小就不吃饭，整天\n吃菩提子人参果，结果把嘴巴吃大了，成天朝人咧嘴呵呵傻笑：\n嘿，有没有好吃的。瞧那馋样儿。\n",
            "bloodgirl": "哦，她呀，从前叫林天雨，长得可好看了。从小呀，\n她奶妈李大嘴就宠着她，性子娇弱了点儿。上回失恋，她差点没\n割脉，后来大伙儿一直劝她才没死成，不过改了个名儿叫火凤凰。\n",
                 "rewj": "阿卡呀，这小子人不错，不过喜欢和女孩子混在一起，这不，到峨嵋山陪尼姑去了。\n",
                 "狗屎": "想吃吗？我有现成的。\n",
                 "大便": "问我这个干嘛？你自己撅撅屁股不就有了？\n",
                  "roc": "这小子偷香窃玉，过去是个雪山的秃驴，近来加入明教，不再做强抢民女的坏事啦。他和小唐开了个镖局，有什么护送人质的事情就去找他吧。\n",
                  "ljf": "这家伙也是一窃玉偷香的好手，把台湾的漂亮美眉轻舞飞扬都骗到手啦。\n",
            "hackerfan": "一键无雪？他呀，酷爱男扮女装，武当的师傅不喜欢他，他到五毒教去啦。\n",
                "perty": "你找他干嘛？他可没我丰满。要吃火锅，还是用我的肉比较好。\n",
                 "wdss": "哦，小宝啊，我跟他很熟。这人比较搞笑，你要是什么时候觉着烦了，就找他吹吹牛吧。\n",
             "raingirl": "您可千万千万瞅仔细喽，这小子不是美眉。看他走路的样子就知道了，虽然屁股扭来扭去的，可身子没那风情。\n",
               "方宝儿": "宝儿也是你叫的？我看你是找打。\n",
                  "jjh": "交际花？哈哈，找他干嘛？他最近手头倒是有几个浙江妹，不过价钱贵得很哪。\n",
               "qingyi": "青衣？唉，这孩子也真可怜，情窦初开就当了太监。听说他对大美女唐方有点意思，可人家喜欢猛男，他只好狂练ＤＦ，整天扛把机关枪四处转悠。\n",
               "huamao": "唐方？人家说那是个大美女，跟小龙女也差不了多少，可那天我看见他在洗澡，哇噻，你猜怎么着？原来是一大老爷们。\n",
                 "唐方": "那是人家宝儿的媳妇儿，这不快过年啦，小两口出门买年货去啦。\n",
                "apple": "水母阴姬？您别说，那桃花岛娘们儿徐娘半老，还挺有那么点儿风韵的，长得有点象麦当劳的苹果派。\n",
            "baobutong": "包不同？这可是个厉害角色，能说会道，还养了一箩筐的毒虫，什么蝎子呀，蜘蛛呀，哇哇，好可怕。\n",
              "flybird": "飞鸟？华山的一哥们儿。喜欢在芙蓉和石井之间飞来飞去的。\n",
               "waiter": "你说小二呀，他不在醉仙楼端茶倒水啦，跑香港去念博士啦。\n",
               "店小二": "我铁哥们儿。那天我在深圳和他从早上喝到晌午，从茶楼喝到麦当劳再到东北小馆子，从铁观音喝到可乐咖啡再到白酒冰啤，鼻涕眼泪汗疙瘩都出来了。\n",
                  "xem": "峨嵋的老尼姑呀，你问她干嘛？去武庙三楼找她吧。\n",
                 "shit": "我的屁股擦得很干净，没有狗屎让你舔。抱歉了。\n",
                 "杀狗": "如果你杀了我准备清炖，那么建议你买口大锅，本狗的肉还是不少的，起码够你全家吃一个腊月。\n",
                 "狗肉": "那可是很好吃的东西呀。不过跟我没什么关系。别老在我面前咽口水，你个死三八。\n",
             "spacenet": "噜噜秋？最近带他的小蜜儿度假去啦。有什么事找他们宿舍的奶牛就好了。\n",
                "along": "你说奶牛呀？他成天往石井跑，这会儿八成又去啦。\n",
              "batwing": "柳随风？那可是一位大侠呀。您要是有什么事，找他准行。\n",
             "tempness": "你是说来来往往？也叫阿猫阿狗。这小子最爱造谣了，喜欢看到屏幕被自己搞得粉红一片。\n",
              "automan": "笑三少？小家伙很聪明，就是皮了点儿。\n",
                 "swgr": "夏洋？人小鬼大，精灵古怪，功课不错，挣钱不少。\n",
               "我是谁": "你不知道我是谁？我也不知道。可是你是谁？又有什么资格问我是谁？\n",
                "sharp": "一箭穿心？鬼知道那一箭射到谁了，他能射到谁呀！？\n",
                 "pass": "阿拐？他在南京，好久没来啦。\n",
                 "sega": "天星？哈哈，跟我一样，又肥又白。如果说我比较适合清炖，他可能比较适合红烧。\n",

                 "泡妞": "你小子最近可真有点儿闷骚。要不怕死，晚上就跟我摸进石井吧。\n",
                   "mm": "美眉？我劝你还是撒泡尿先照照自己的模样儿。瞧见了吧，就你那样儿，五短身材，贼眉鼠眼的，最多也就能泡上个阿庆嫂。\n",
             "constant": "不要乱打听，见着他你叫一声“大爷”准没错。\n",
              "heretic": "这可是你大爷，没事别乱打听。\n",
                 "dean": "萧傲？好久没来啦。此人已经不在江湖，你就别打听了吧。\n",
              "zeratul": "寒江雪？一个老头子，喜欢钓鱼，去找他学两招吧。\n",

	]));

	setup();
	carry_object(CLOTH_DIR"male-cloth")->wear();
        carry_object(CLOTH_DIR"male-shoe")->wear();
}
void relay_emote(object ob, string verb)
{
      if( !userp(ob) ) return;

      switch(verb)
      {
                 case "zhu":
                 command("pig1 " + ob->query("id"));
                 command("niu ");
                 break;
                 case "puke":
                 command("pei ");
                 command("seal " + ob->query("id"));
                 break;
                 case "seal":
                 command("heng ");
                 command("cuff " + ob->query("id"));
                 break;
                 case "hi":
                 command("brother1 " + ob->query("id"));
                 break;
                 case "wanfu":
                 command("count " + ob->query("id"));
                 break;
                 case "kick":
                 command("say 靠，你小子敢踢我。我不打得你满脸桃花开，你就不知道花儿为什么这么红！");
                 command("claw " + ob->query("id"));
                 break;
            case "slap":
                 command("say 你小子活腻了不成？敢碰大狗狗的漂亮脸蛋儿？");
                 command("cuo " + ob->query("id"));
                 break;
            case "hammer":
                 command("pain ");
                 command("pain " + ob->query("id"));
                 break;
            case "hammer1":
                 command("pain ");
                 command("pain " + ob->query("id"));
                 break; 
            case "hammer2":
                 command("pain ");
                 command("pain " + ob->query("id"));
                 break; 
            case "pk":
                 command("grin ");
                 command("bigman " + ob->query("id"));
                 break;
            case "pk1":
                 command("grin " + ob->query("id"));
                 command("doubt " + ob->query("id"));
                 break;
            case "nip":
                 command("axe " + ob->query("id"));
                 break;
            case "claw":
                 command("staff " + ob->query("id"));
                 break;
            case "faint":
                 command("inn1 " + ob->query("id"));
                 break;
            case "sigh":
                 command("sigh1 ");
                 command("sigh1 " + ob->query("id"));
                 break;
            case "benger":
                 command("pain ");
                 command("pain " + ob->query("id"));
                 break; 
            case "trip":
                 command("pain ");
                 command("inn1 " + ob->query("id"));
                 break; 
            case "bite":
                 command("bite ");
                 command("chan " + ob->query("id"));
                 break;
            case "papaya":
                 command("heng ");
                 command("pig1 " + ob->query("id"));
                 break;
            case "mo":
                 command("giggle ");
                 command("taoyan " + ob->query("id"));
                 break;
            case "cuo":
                 command("pain ");
                 command("say 有点疼，不过还挺舒服的。");
                 command("giggle ");
                 break;
            case "pig1":
                 command("angry ");
                 command("piggy " + ob->query("id"));
                 break;

      }
}
