// yixin.c

inherit ITEM;

void create()
{
        set_name("阳教主遗信", ({"yi xin", "xin", "letter"}));
        set_weight(100);
        if( clonep() )
                set_default_object(__FILE__);
        else {
                set("unit", "封");
                set("long",
"夫人亲启\n\n"
"    夫人妆次：夫人自归阳门，日夕郁郁。余粗鄙寡德，无足为欢，甚可歉咎，\n"
"兹当永别，唯夫人谅之。三十二代衣教主遗命，令余练成乾坤大挪移神功后，率\n"
"众前赴波斯总教，设法迎回圣火令。本教虽发源于波斯，然在中华生根，开枝散\n"
"叶，已数百年于兹。今鞑子占我中土，本教誓与周旋到底，决不可遵波斯总教无\n"
"理命令，而奉蒙古元人为主。圣火令若重入我手，我中华明教即可与波斯总教分\n"
"庭抗礼也。\n"
"    今余神功第四层初成，即悉成昆之事，血气翻涌不克自制，真力将散，行当\n"
"大归。天也命也，复何如耶？\n"
"    今余命在旦夕，有负衣教主重托，实为本教罪人。盼夫人持余此亲笔遗书，\n"
"召聚左右光明使者、四大护教法王、五行旗使、五散人，颁余遗命曰：‘不论何\n"
"人重获圣火令者，为本教第三十四代教主。不服者杀无赦。令谢逊暂摄副教主之\n"
"位，处分本教重务。’\n"
"    乾坤大挪移心法暂由谢逊接掌，日后转奉新教主。光大我教，驱除胡虏，行\n"
"善去恶，持正除奸，令我明尊圣火普惠天下世人，新教主其勉之。\n"
"    余将以身上残存功力，掩石门而和成昆共处。夫人可依秘道全图脱困。当世\n"
"无第二人有乾坤大挪移之功，即无第二人能推动此‘无妄’位石门，待后世豪杰\n"
"练成，余及成昆骸骨朽矣。\n"
"                                                 顶天谨白。\n\n"
"    余名顶天，然于世无功，于教无勋，伤夫人之心，赍恨而没，狂言顶天立地，\n"
"诚可笑也。\n"
);
                set("material", "paper");
        }
}

