// qingxu.c 清虚

#include "daozhang.h"
inherit NPC;
inherit F_MASTER;
inherit F_UNIQUE;

void create()
{
        set_name("清虚道长", ({ "qingxu daozhang", "qingxu", "daozhang" }));
        set("long","他是张松溪的弟子，剑术算不得很精，但年轻之时，曾在西域住过十几年，\n学得一项特别本事，精擅机关削器之术。\n他今年三十八岁，主管武当派后山的俗事。\n");
        set("gender", "男性");
        set("age", 38);
        set("attitude", "peaceful");
        set("shen_type", 1);
        set("class", "taoist");
        set("str", 25);
        set("int", 25);
        set("con", 25);
        set("dex", 25);

        set("max_qi", 1500);
        set("max_jing", 800);
        set("neili", 1000);
        set("max_neili", 1000);
        set("jiali", 30);
        set("combat_exp", 60000);
        set("score", 8000);

        set_skill("force", 50);
        set_skill("taiji-shengong", 50);
        set_skill("dodge", 50);
        set_skill("tiyunzong", 70);
        set_skill("unarmed", 60);
        set_skill("taiji-quan", 60);
        set_skill("parry", 50);
        set_skill("sword", 60);
        set_skill("wudang-jian", 40);
        set_skill("wudang-quan", 40);
        set_skill("taoism", 50);
        set_skill("literate", 50);

        map_skill("force", "taiji-shengong");
        map_skill("dodge", "tiyunzong");
        map_skill("unarmed", "taiji-quan");
        map_skill("parry", "wudang-jian");
        map_skill("sword", "wudang-jian");
	set("inquiry", ([
		"name" : "贫道便是清虚，不知这位"+ RANK_D->query_respect(this_player())+"有何见教？",
		"武当" : "贫道便是武当派弟子，不知这位"+ RANK_D->query_respect(this_player())+"有何见教？",
		"武当派" : "贫道便是武当派弟子，不知这位"+ RANK_D->query_respect(this_player())+"有何见教？",
		"太极剑" : "嗯……这我不大清楚，你得去问冲虚师兄。",
		"太极剑法" : "嗯……这我不大清楚，你得去问冲虚师兄。",
		"武当剑" : "嗯……武当剑的质地柔韧不足，坚硬易脆，对方如果使用重器械，则不宜与其硬碰硬撞。",
		"武当剑法" : "武当剑法使起来又狠又稳，一招之间能生出许多变化。",
		"两仪剑法" : "两仪剑法中有阴有阳，亦刚亦柔，神妙精微无比。",
		"武当两仪剑" : "两仪剑法中有阴有阳，亦刚亦柔，神妙精微无比。",
		"绕指柔剑" : "这路剑法我可不会使。",
		"神门十三剑" : "这路剑法我可不会使。",
		"武当长拳" : "拳脚功夫非贫道所长。",
		"绵掌" : "拳脚功夫非贫道所长。",
		"震山掌" : "拳脚功夫非贫道所长。",
		"虎爪绝户手" : "嗯……曾听说敝派有这一路武功，但从未见师伯师叔使过。",
		"张三丰" : "敝派创派祖师，近年来常年闭关不出。",
		"张真人" : "敝派创派祖师，近年来常年闭关不出。",
		"宋远桥" : "那是敝派掌门大师伯。",
		"宋大侠" : "那是敝派掌门大师伯。",
		"俞莲舟" : "那是二师伯。",
		"俞二侠" : "那是二师伯。",
		"俞岱岩" : "那是三师伯。",
		"俞三侠" : "那是三师伯。",
		"张松溪" : "贫道的授业恩师",
		"张四侠" : "贫道的授业恩师",
		"张翠山" : "………那是贫道的五师叔。",
		"张五侠" : "………那是贫道的五师叔。",
		"殷梨亭" : "那是六师叔。",
		"殷六侠" : "那是六师叔。",
		"莫声谷" : "那是七师叔。",
		"莫七侠" : "那是七师叔。",
		"宋青书" : "好久没见到宋师哥了，听说他和莫七叔吵过架，就此再没回武当过。",
		"冲虚" : "他是贫道的师兄，三代弟子中也就他会使太极剑法。",
		"冲虚道长" : "他是贫道的师兄，三代弟子中也就他会使太极剑法。",
		"谷虚" : "谷虚师兄是三代弟子中的佼佼者，近年来负责在山上主持武当事务。",
		"谷虚道长" : "谷虚师兄是三代弟子中的佼佼者，近年来负责在山上主持武当事务。",
		"清虚道长" : "贫道便是清虚，不知这位"+ RANK_D->query_respect(this_player())+"有何见教？",
		"凌虚" : "凌虚师弟在遇真宫，负责制造香火。",
		"凌虚道长" : "凌虚师弟在遇真宫，负责制造香火。",
		"制香" : "凌虚师弟在遇真宫，负责制造香火。",
		"制香道长" : "凌虚师弟在遇真宫，负责制造香火。",
		"灵虚" : "灵虚师弟在山门，负责接待来客。",
		"灵虚道长" : "灵虚师弟在山门，负责接待来客。",
		"知客" : "灵虚师弟在山门，负责接待来客。",
		"知客道长" : "灵虚师弟在山门，负责接待来客。",
		"成高" : "他是贫道的师侄，以前曾与贫道在西域住过十几年，现在负责看守榔梅园。",
		"成高道长" : "他是贫道的师侄，以前曾与贫道在西域住过十几年，现在负责看守榔梅园。",
		"守园" : "他是贫道的师侄，以前曾与贫道在西域住过十几年，现在负责看守榔梅园。",
		"守园道长" : "他是贫道的师侄，以前曾与贫道在西域住过十几年，现在负责看守榔梅园。",
		"炸药" : "嗯……这我不大清楚，你得去问成高师侄。",
		"火药" : "嗯……这我不大清楚，你得去问成高师侄。",
		"制造炸药" : "嗯……这我不大清楚，你得去问成高师侄。",
		"制造火药" : "嗯……这我不大清楚，你得去问成高师侄。",
		"机关" : "贫道曾在西域向当地工匠学过机关削器之术。",
		"机关削器" : "贫道曾在西域向当地工匠学过此术。",
		"清虚" : "贫道便是清虚，不知这位"+ RANK_D->query_respect(this_player())+"有何见教？",
	]));
        set("env/wimpy", 60);
        create_family("武当派", 3, "弟子");

        setup();
	carry_object(WEAPON_DIR"changjian")->wield();
	carry_object(CLOTH_DIR"dao-cloth")->wear();
	carry_object(CLOTH_DIR"dao-shoe")->wear();
}

