// changquan.c 太祖长拳
// Last Modified by winder on Nov. 15 2000

#include <ansi.h>
inherit SKILL;
string type() { return "martial"; }
string martialtype() { return "skill"; }

string *msg = ({
"只见$N身形一矮，大喝声中一个『冲天炮』对准$n的鼻子呼地砸了过去",
"$N左手一分，右拳运气，一招『拔草寻蛇』便往$n的$l招呼过去",
"$N右拳在$n面门一晃，左掌使了个『叶底偷桃』往$n的$l狠命一抓",
"$N步履一沉，左拳拉开，右拳带风，一招『黑虎掏心』势不可挡地击向$n$l",
"只见$N拉开架式，一招『双风贯耳』使得虎虎有风。底下却飞起一脚踢向$n$l",
"$N打得兴起，大喝一声：看我这招『龙虎相交』！ \n左手往$n身后一抄，右拳便往$n面门砸了过去",
"$N拉开后弓步，双掌使了个『如封似闭』往$n的$l一推",
"只见$N运足气力，一连三拳击向$n$l，力道一拳高过一拳！ \n这一招的名字还相当高雅，叫作『阳关三叠』",
"$N往后一纵，就势使了个『老树盘根』，右腿扫向$n的$l",
"$N一个转身，左掌护胸，右掌反手使了个『独劈华山』往$n当头一劈",
"$N一招『双抄封天』，下半身右脚撇步上前，双手化掌，向前双抄上击$n的$l",
"$N身体向前冲出，一式『冲步双掌』，双手先抱回腰际後，再向前以双撑掌直推而出",
"$N全身原步右转，右手向右刁出，左手顺势护肩，『回首双刁』抓向$n的$l",
"$N提起左腿，伸直右腿成独立步站定，『魁星踢斗』左腿顺势向前直蹬而出",
"$N一招『进步冲捶』，上右步至左脚旁，双手以双冲拳向$n直击而出",
"$N出一式『弓步冲打』，左脚向左跨出，身体尽量压低，拉回左手，右拳向前直击而出",
"$N一式『拍案齐掌』，全身微向下坐，产生後拉之势，收左手，右手化掌向前直压而出",
"$N保持原弓箭步站定不动，『燕子抄水』右掌原地翻掌，左手以反掌由右掌上方直穿而出",
"$N出『扭步断肘』，右步跟前，成玉环步蹲定，顺势收回左手，右手向前以平肘直扣而出",
"$N步法先右後左，连续上步，一式『双采冲捶』右拳向$n的$l直击而出",
"$N拉回右手，左手化拳向前直击而出，同时『左冲右踢』右腿向前平踢而出",
"$N右脚向前落步，成马步坐定，『马式挑打』在左手收回腰际，右拳向右直击而出",
"$N一式『英雄独立』，右拳原地翻掌，左掌化刁手斜刁身后，全式一气呵成，瞬间完成",
"$N一招『猛虎伏案』，右腿向前直铲而出，成伏虎步坐定，双手以反刁手刁定$n",
"$N一招『魁星独立』伸直右腿，将重心坐於左脚上，随著拔起之势，右掌向$n直挑而出",
"$N原势不动，一招『窜步偷心』快速窜前，提起右腿向前快踢，同时左掌向前平推而出",
"$N向前一招『双龙探爪』，双手变掌为爪，先右後左，连续向$n的$l击出",
"$N向前一窜，『猛虎出洞』将左刁手向後回勾，与右刁手同置身后再刁撇而出",
"$N身体保持後刁手姿势不变，『朝天一蹬』右腿伸直，向前以腿式直踢$n$l",
"$N来了个『虚步断肘』，轻点地面成虚步坐定，右拳顺势向前反冲而上",
"$N右手化掌，『采手冲捶』向前圈采而出，又顺势拉回右手，将左拳向$n击出",
"$N向前冲出三步，一式『三步行拳』双拳先右後左，连续向$n直击而出",
"$N一式『马式挑打』，右脚向前落步成马步坐定，左手收回腰际，右拳直击而出",
"$N一招『斜步插花』微向右转，成独立步站定，同时右手化掌向$n探抓",
"$N左手由右掌上方直穿而出，这招『左穿云手』直插$n的$l",
"$N右手由左掌上方直穿而出，一招『右穿云手』插向$n的$l",
"$N向左后方跳出，一式『跳步断肘』，右手化肘，向左面$n横扣而出",
"$N出『截步双崩』，右腿落步坐定，双拳挑起，藉著击胸之力向两侧崩击而出",
"$N成丁字步，『落步盘花』左拳极力向上反穿而出，接著收回右掌，向下击落",
"$N出一招『翻身平掌』，全身向左转正，左手化刁手，右手以横切掌向$n直切而出",
"$N一招『走马活挟』，左右手同时以穿云手向$n穿出，连环三式",
"$N一式『回马横擂』，左腿向前踢出双飞腿，同时左手回勾，右手前穿拍向$n",
"$N双手右甩左手护肩，一式『回挑冲拳』右手曲肘上架，左拳向$n$l直击而出",
"$N保持原弓箭步站定不动，一招『顺步采手』，双手以小缠手向上圈采",
"$N撑直左腿步法下压，『窝肚冲捶』双手顺势以窝肚捶向$n$l直推而出",
"$N左手圈封而回护住右肩，一招『翻天劈地』右手以钻拳向$n穿打而出",
"$N身体向上挑起，出『马式挑捶』在右手收回腰际之时左拳向$n直击而出",
"$N右腿向前以小扫腿向前扫出，双手握拳『泰山压顶』直压向$n的$l",
"$N右掌由後向前反挑而上，然后出『翻江走海』双手向两侧以双抄掌压落",
"$N出『回步双切』，身体後仰，双手同时向前双抄而上，打向$n的$l",
"$N身体右倾，一招『反身插花』，左掌不动，右掌向右下方反切$n$l",
"$N一式『翻天双风』，双手以双抄掌向前反切而出，於面前硬碰，发出声音",
"$N右腿向前直踢而出，『翻手箭弹』接着双掌内翻，右手化掌，左手刁扣$n",
"$N左刁手不动，右掌收回胸前续劲，『顺势推山』以立掌向$n直推而出",
"$N收回双手，以十字手封住胸前，『拗步听风』接着双掌向$n平撑而出",
"$N一招『拐子腿法』，全身向上撑起，左腿顺势向左横踢$n的$l",
"$N伸直右腿，将重心坐於左脚上，『魁星独立』随著拔起之势，右掌向前直挑而出",
"$N一式『走回马枪』，双手右甩，左手护肩，右手极力下甩又直挑而上",
});
int valid_enable(string usage) { return usage=="cuff" || usage=="parry"; }
int valid_combine(string combo) { return combo=="sanshou"; }

mapping query_action(object me, object weapon)
{
	return ([
		"action" : msg[random(sizeof(msg))],
		"dodge"  : 40+random(20),
		"parry"  : -20+random(20),
		"force"  : 50+random(150),
		"damage_type" : random(2)?"内伤":"瘀伤",
	]);
}
int valid_learn(object me)
{
	if( me->query_temp("weapon") || me->query_temp("secondary_weapon"))
		return notify_fail("练太祖长拳必须空手。\n");
	return 1;
}
int practice_skill(object me)
{
	if( (int)me->query("jing") < 30)
		return notify_fail("你的精神无法集中了，休息一下再练吧。\n");
	if( (int)me->query("qi") < 30 )
		return notify_fail("你现在手足酸软，休息一下再练吧。\n");
	if( (int)me->query("neili") < 10 )
		return notify_fail("你的内力不够了。\n");

	me->receive_damage("qi", 30);
	me->add("neili", -10);

	return 1;
}
int learn_bonus() { return 30; }
int practice_bonus() { return 30; }
int success() { return 20; }
int power_point(object me) { return 1.0; }
string perform_action_file(string action)
{
	return __DIR__"changquan/" + action;
}

int help(object me)
{
	write(HIC"\n太祖长拳："NOR"\n");
	write(@HELP
	
    太祖长拳是冷氏家传拳技。冷氏先祖为明朝武职左参游击将军，
明亡后挟技隐居民间，肆机反清复明（有其家谱为证），其后人曾为
乾隆、嘉庆两朝皇帝的待卫（有石碑为证）。此拳因其家族保守，不
允许其它拳种有丁点渗入，也不允许族人任意改动，故保持了原始的
风貌，传至我处已历二十三世。此拳在《纪效新书》、《阵记》、
《少林拳谱》、《玄机秘授穴道拳诀》等许多古代拳谱中均有记载，
但由于其先辈怀珍自秘，故社会传习较少，现社会中会“太祖四进长拳
”者颇多，但完整继承此拳种的人却寥若星辰。 

    太祖长拳的主要内容有： 
    一、拳术类：太祖四进长拳（含拳谱）、六路捶（一路白马圈向
<含拳谱>/二路叶里藏花<含拳谱>/三路三把/四路八个字<含拳谱>/五
路斩拿捶/六路燕青靠） 
    二、器械类：五路太祖卧龙刀/太祖双刀/太祖花枪（含拳谱）/
穿林枪（含拳谱）/太祖腾蛇棍/十合大棒（含拳谱）/双合棍（拐子）
/二女争夫棍（三人对练）/桃园棍（赵匡胤、卢镇恩、陶三春对练）
/太祖盘龙鞭（含拳谱）/流星捶（含拳谱）/春秋大刀（含拳谱）/竹
杆点大枪（出枪、活枪、三扑三盖、卷帘枪）/金钱豹拿猴子（六人
对练）等。 
    太祖长拳以实战为主，拳势多腿法，跌仆为主要攻击手段，擒拿
为独门绝技（均含破解之法，六路捶即为擒拿对练），用老拳师们的
话讲就是“咱这拳里有骨头啃”，言下之意即是技击价值很高。另外，
此拳有个不容忽视的重点，就是它的健身价值，其习练太祖长拳的老
拳师中，九十岁以上高龄者颇多，其中以第二十二世张玉华为最，享
年九十七岁。

	学习要求：
		无
HELP
	);
	return 1;
}